In [1]:
import numpy as np
import pandas as pd

%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

In [3]:
df = pd.read_csv("data.csv")
df.head()

,job title,hh_title,age,salary,exp. period,title of exp.
0,data analyst,Data analyst,22.0,NaN,2.67,Data Analyst
1,data analyst,Data Analyst,21.0,NaN,0.83,Junior Data Analyst
2,data analyst,Data Analyst,30.0,NaN,7.50,Data Analyst
3,data analyst,Data Analyst,24.0,NaN,4.92,Data Analyst
4,data analyst,Data Analyst,27.0,450000.0,3.25,Business Intelligence Analyst

In [4]:
sdf = df.loc[:,["job title", "age", "salary", "exp. period"]]
sdf

        job title   age    salary  exp. period
0    data analyst  22.0       NaN         2.67
1    data analyst  21.0       NaN         0.83
2    data analyst  30.0       NaN         7.50
3    data analyst  24.0       NaN         4.92
4    data analyst  27.0  450000.0         3.25
..            ...   ...       ...          ...
995           sql  51.0       NaN        25.42
996           sql  22.0       NaN         1.58
997           sql  42.0       NaN         9.33
998           sql   NaN       NaN        16.08
999           sql  19.0       NaN         0.33

[1000 rows x 4 columns]

In [5]:
x = sdf.drop("job title",axis=1)
x

      age    salary  exp. period
0    22.0       NaN         2.67
1    21.0       NaN         0.83
2    30.0       NaN         7.50
3    24.0       NaN         4.92
4    27.0  450000.0         3.25
..    ...       ...          ...
995  51.0       NaN        25.42
996  22.0       NaN         1.58
997  42.0       NaN         9.33
998   NaN       NaN        16.08
999  19.0       NaN         0.33

[1000 rows x 3 columns]

In [6]:
y = sdf["job title"]
y

0      data analyst
1      data analyst
2      data analyst
3      data analyst
4      data analyst
           ...
995             sql
996             sql
997             sql
998             sql
999             sql
Name: job title, Length: 1000, dtype: object

In [7]:
x = x.fillna(0)
y = y.fillna(0)

In [8]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

In [9]:
xtrain, xtest, ytrain, ytest =  train_test_split(x,y,train_size=0.8, stratify=y)
x, y

(      age    salary  exp. period
 0    22.0       0.0         2.67
 1    21.0       0.0         0.83
 2    30.0       0.0         7.50
 3    24.0       0.0         4.92
 4    27.0  450000.0         3.25
 ..    ...       ...          ...
 995  51.0       0.0        25.42
 996  22.0       0.0         1.58
 997  42.0       0.0         9.33
 998   0.0       0.0        16.08
 999  19.0       0.0         0.33

 [1000 rows x 3 columns],
 0      data analyst
 1      data analyst
 2      data analyst
 3      data analyst
 4      data analyst
            ...
 995             sql
 996             sql
 997             sql
 998             sql
 999             sql
 Name: job title, Length: 1000, dtype: object)

In [10]:
from sklearn.naive_bayes import GaussianNB
model= GaussianNB()

In [11]:
model.fit(xtrain, ytrain)

GaussianNB()

In [12]:
y_model= model.predict(xtest)

In [13]:
from sklearn.metrics import accuracy_score
accuracy_score(y_model, ytest)

0.345

In [14]:
from sklearn.model_selection import cross_val_score

In [15]:
cross_val_score (model,x,y, cv= 10)

array([0.35, 0.33, 0.35, 0.34, 0.35, 0.34, 0.35, 0.34, 0.35, 0.34])

In [16]:
scores = cross_val_score (model,x,y, cv= 10)
scores.mean()

0.344

In [17]:
from sklearn.neighbors import KNeighborsClassifier

In [18]:
model_KNC = KNeighborsClassifier(n_neighbors=3)

In [19]:
model_KNC.fit(xtrain,ytrain)

KNeighborsClassifier(n_neighbors=3)

In [20]:
y_model_2 = model.predict(xtest)

In [21]:
from sklearn.metrics import accuracy_score
accuracy_score(ytest,y_model_2)

0.345

In [25]:
from sklearn.model_selection import cross_val_score
cross_val_score(model_KNC, x, y, cv=10)

array([0.88, 0.86, 0.87, 0.85, 0.87, 0.87, 0.86, 0.84, 0.87, 0.85])

In [26]:
scores_2= cross_val_score(model_KNC, x, y, cv=10)
scores_2.mean()

0.8620000000000001